Autodesk.Revit.DB.FabricationPart.CreateHanger(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FabricationServiceButton,System.Int32,Autodesk.Revit.DB.ElementId)
Creates a free placed hanger.
document:
The document.
button:
The fabrication service button to use.
condition:
The condition index. If the button has multiple conditions.
levelId:
The level identifier of the hanger.
Returns:
The newly-created fabrication hanger.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Invalid fabrication service button.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index condition is not larger or equal to 0 and less than ConditionCount
Since:
2017

Autodesk.Revit.DB.FabricationPart.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FabricationServiceButton,System.Int32,Autodesk.Revit.DB.ElementId)
Creates a fabrication part element based on button.
document:
The document.
button:
The fabrication service button to use.
condition:
The condition index.
levelId:
The level identifier.
Returns:
The new fabrication part.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Fabrication service button contains invalid fittings.
-or-
Please use FabricationPart.CreateHanger to create fabrication hanger.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index condition is not larger or equal to 0 and less than ConditionCount
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The fabrication part type does not exist. Reload the service using FabricationConfiguration.LoadServices.
Since:
2016

Autodesk.Revit.DB.FabricationPart.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.FabricationServiceButton,System.Double,System.Double,Autodesk.Revit.DB.ElementId)
Creates a fabrication part element based on button and size.
document:
The document.
button:
The fabrication service button to use. Matches button condition based on the specified size.
width:
The width of the part. Units are in feet (ft).
depth:
The depth of the part. Units are in feet (ft). It should be equal to width for round part.
levelId:
The level identifier.
Returns:
The new fabrication part.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Fabrication service button contains invalid fittings.
-or-
Please use FabricationPart.CreateHanger to create fabrication hanger.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The fabrication part type does not exist. Reload the service using FabricationConfiguration.LoadServices.
-or-
failing to match a button condition based on specific size.
Since:
2016

Autodesk.Revit.DB.FabricationPart.GeometryChecksum
Gets the geometry checksum of the fabrication part symbol, and it dose nothing with the fabrication part instance position.
Since:
2018.2